In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv("Automobile_data.csv")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   index             61 non-null     int64
 1   company           61 non-null     object
 2   body-style        61 non-null     object
 3   wheel-base        61 non-null     float64
 4   length            61 non-null     float64
 5   engine-type       61 non-null     object
 6   num-of-cylinders  61 non-null     object
 7   horsepower        61 non-null     int64
 8   average-mileage   61 non-null     int64
 9   price             58 non-null     float64
dtypes: float64(3), int64(3), object(4)
memory usage: 4.9+ KB

In [4]:
df.describe()

,index,wheel-base,length,horsepower,average-mileage,price
count,61.000000,61.000000,61.000000,61.000000,61.000000,58.000000
mean,40.885246,98.481967,173.098361,107.852459,25.803279,15387.000000
std,25.429706,6.679234,14.021846,53.524398,8.129821,11320.259841
min,0.000000,88.400000,141.100000,48.000000,13.000000,5151.000000
25%,18.000000,94.500000,159.100000,68.000000,19.000000,6808.500000
50%,39.000000,96.300000,171.200000,100.000000,25.000000,11095.000000
75%,61.000000,101.200000,177.300000,123.000000,31.000000,18120.500000
max,88.000000,120.900000,208.100000,288.000000,47.000000,45400.000000

In [5]:
df.sample(10)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
41,54,nissan,sedan,94.5,165.3,ohc,four,69,31,6649.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
22,31,isuzu,sedan,94.5,155.9,ohc,four,70,38,NaN
21,30,isuzu,sedan,94.3,170.7,ohc,four,78,24,6785.0
12,15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
51,69,toyota,wagon,95.7,169.7,ohc,four,62,31,6918.0
47,63,porsche,hatchback,98.4,175.7,dohcv,eight,288,17,NaN
46,62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
40,53,nissan,sedan,94.5,165.3,ohc,four,55,45,7099.0
38,51,mitsubishi,sedan,96.3,172.4,ohc,four,88,25,6989.0

In [6]:
#deal with missing data in price column
df['price']=df['price'].fillna(method='ffill')

# From given data set print first and last five rows

In [7]:
print(df.head(5))
print(df.tail(5))

   index      company   body-style  wheel-base  length engine-type  \
0      0  alfa-romero  convertible        88.6   168.8        dohc
1      1  alfa-romero  convertible        88.6   168.8        dohc
2      2  alfa-romero    hatchback        94.5   171.2        ohcv
3      3         audi        sedan        99.8   176.6         ohc
4      4         audi        sedan        99.4   176.6         ohc

  num-of-cylinders  horsepower  average-mileage    price
0             four         111               21  13495.0
1             four         111               21  16500.0
2              six         154               19  16500.0
3             four         102               24  13950.0
4             five         115               18  17450.0
    index     company body-style  wheel-base  length engine-type  \
56     81  volkswagen      sedan        97.3   171.7         ohc
57     82  volkswagen      sedan        97.3   171.7         ohc
58     86  volkswagen      sedan        97.3   171.7         ohc
59     87       volvo      sedan       104.3   188.8         ohc
60     88       volvo      wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0

# Replace all column values which contain ‘?’ and n.a with NaN.

In [8]:
df=df.replace({'?':"NaN",'n.a':"NaN"})

# Find the most expensive car company name

In [9]:
print(df['price'].max())

45400.0

In [10]:
print(df['company'].loc[df['price']==45400.0])

35    mercedes-benz
Name: company, dtype: object

# Print All Toyota Cars details

In [11]:
print(df[df['company']=='toyota'])
#print(df.loc[df['company']=='toyota'])

    index company body-style  wheel-base  length engine-type num-of-cylinders  \
48     66  toyota  hatchback        95.7   158.7         ohc             four
49     67  toyota  hatchback        95.7   158.7         ohc             four
50     68  toyota  hatchback        95.7   158.7         ohc             four
51     69  toyota      wagon        95.7   169.7         ohc             four
52     70  toyota      wagon        95.7   169.7         ohc             four
53     71  toyota      wagon        95.7   169.7         ohc             four
54     79  toyota      wagon       104.5   187.8        dohc              six

    horsepower  average-mileage    price
48          62               35   5348.0
49          62               31   6338.0
50          62               31   6488.0
51          62               31   6918.0
52          62               27   7898.0
53          62               27   8778.0
54         156               19  15750.0

# Count total cars per company

In [4]:
print(df['company'].unique())
c=df['company'].unique()
for i in c:
    n=df["company"].loc[df["company"]==i].count()
    print(i,':',n)
print("\n\n\nAnother short method by solution:\n")
print(df['company'].value_counts())

['alfa-romero' 'audi' 'bmw' 'chevrolet' 'dodge' 'honda' 'isuzu' 'jaguar'
 'mazda' 'mercedes-benz' 'mitsubishi' 'nissan' 'porsche' 'toyota'
 'volkswagen' 'volvo']
alfa-romero : 3
audi : 4
bmw : 6
chevrolet : 3
dodge : 2
honda : 3
isuzu : 3
jaguar : 3
mazda : 5
mercedes-benz : 4
mitsubishi : 4
nissan : 5
porsche : 3
toyota : 7
volkswagen : 4
volvo : 2



Another short method by solution:

toyota           7
bmw              6
nissan           5
mazda            5
mitsubishi       4
volkswagen       4
mercedes-benz    4
audi             4
jaguar           3
chevrolet        3
honda            3
alfa-romero      3
isuzu            3
porsche          3
dodge            2
volvo            2
Name: company, dtype: int64

# Find each company’s Highest price car

In [21]:
g=df.groupby(by="company")
print(g['price'].max())

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

# Find the average mileage of each car making company

In [22]:
g=df.groupby(by="company")
print(g['average-mileage'].agg(np.mean))

company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            33.333333
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

# Sort all cars by Price column

In [26]:
print(df.sort_values(by='price',ascending=False).head(5))

    index        company   body-style  wheel-base  length engine-type  \
35     47  mercedes-benz      hardtop       112.0   199.2        ohcv
11     14            bmw        sedan       103.5   193.8         ohc
34     46  mercedes-benz        sedan       120.9   208.1        ohcv
46     62        porsche  convertible        89.5   168.9        ohcf
47     63        porsche    hatchback        98.4   175.7       dohcv

   num-of-cylinders  horsepower  average-mileage    price
35            eight         184               14  45400.0
11              six         182               16  41315.0
34            eight         184               14  40960.0
46              six         207               17  37028.0
47            eight         288               17  37028.0

# Concatenate two data frames using the following conditions
Create two data frames using the following two Dicts, Concatenate those two data frames and create a key for each data frame.

In [28]:
GermanCars = pd.DataFrame({'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]})
japaneseCars = pd.DataFrame({'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]})
print(pd.concat([GermanCars,japaneseCars],keys=['Germany','Japan']))

               Company   Price
Germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
Japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900

# Merge two data frames using the following condition
Create two data frames using the following two Dicts, Merge two data frames, and append the second data frame as a new column to the first data frame.